"""ЗАДАНИЕ 4
Склонение слова
Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран
отдельной строкой для каждого из чисел в интервале от 1 до 100:
1 процент
2 процента
3 процента
4 процента
5 процентов
6 процентов
...
100 процентов"""

for number in range(1, 101):
    if number % 10 == 1 and number // 10 != 1:
        print(number, 'процент')
    elif 2 <= number % 10 <= 4 and number // 10 != 1:
        print(number, 'процента')
    else:
        print(number, 'процентов')
